# Имя, по которому Triton будет предоставлять доступ к этой модели.
name: "gemma"

# Указываем, что запросы обрабатывает бэкенд vLLM.
backend: "vllm"

# Максимальное количество запросов, которые Triton может объединить.
max_batch_size: 0

# Ключевой блок для включения режима стриминга.
model_transaction_policy {
  decoupled: true
}

# Описание входных и выходных данных ОСТАЕТСЯ ЗДЕСЬ.
# Triton должен знать, какие данные принимать и отдавать.
input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "stream"
    data_type: TYPE_BOOL
    dims: [ 1 ]
    optional: true
  },
  {
    name: "sampling_parameters"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]